Step 1 : Data Exploration

In [1]:
# importing libraries
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import mysql.connector

In [2]:
df = pd.read_csv('Walmart.csv', encoding_errors='ignore')
# df.head()
df.shape

(10051, 11)

In [3]:
# Remove duplicates
df.drop_duplicates(inplace=True)
df.shape

(10000, 11)

In [4]:
# Remove NaN vales

df.dropna(inplace=True)
df.shape

(9969, 11)

In [5]:
# unit_prise is $ sign and it is in string format, now converting it into integer format

df['unit_price'] = df['unit_price'].str.replace('$', '').astype(float)

In [6]:
# Adding new column total
df['total'] = df['unit_price'] * df['quantity']

In [7]:
# Converting columns name into lower case
df.columns = df.columns.str.lower()

In [23]:
# Connecting to database mysql
engine = create_engine("mysql+pymysql://root:jayesh123@localhost/walmart")

try:
    connection = engine.connect()
    print("Connection is Successful!")
    connection.close()
except Exception as e:
    print(f"Unable to connect: {e}")

# Export Data into MySQL database
try:
    df.to_sql(name='walmart_tbl', con=engine, if_exists='append', index=False)
    print("Data exported successfully!")
except Exception as e:
    print(f"Error exporting data: {e}")

Connection is Successful!
Data exported successfully!

Q1. Find the top 5 total number of transactions for each branch.

In [24]:

query1 =  """select branch,
count(*) as no_transaction
from walmart_tbl
group by branch
order by no_transaction desc
limit 5"""
 

res = pd.read_sql(query1, con=engine)
print(res)

    branch  no_transaction
0  WALM058            4302
1  WALM009            4230
2  WALM030            4122
3  WALM069            3996
4  WALM074            3780

Q2. Calculate the total revenue for each city, include only cities where total revenue upto 500.

In [31]:

query2 = """select city,sum(total) as total_revenue
from walmart_tbl
group by city
having SUM(total) > 500;"""

res = pd.read_sql(query2, con=engine)
print(res)

            city  total_revenue
0    San Antonio      324357.28
1      Harlingen      105700.40
2    Haltom City      133021.33
3        Bedford      108933.37
4         Irving       81082.43
..           ...            ...
93        Laredo      107063.06
94         Tyler      239613.79
95       El Paso      103498.98
96  Lake Jackson       65505.70
97   Nacogdoches      132270.32

[98 rows x 2 columns]

Q3. Find the earliest and latest transaction dates for each payment method.

In [32]:
 
query3 = """SELECT payment_method, MIN(date) AS earliest_date, MAX(date) AS latest_date
FROM walmart_tbl
GROUP BY payment_method;"""

res = pd.read_sql(query3, con=engine)
print(res)

  payment_method earliest_date latest_date
0        Ewallet      01/01/19    31/12/23
1           Cash      01/01/19    31/12/23
2    Credit card      01/01/19    31/12/23

Q4. Find the total profit margin for all transactions.

In [33]:

query4 = """SELECT SUM(profit_margin) AS total_profit_margin 
FROM walmart_tbl;"""


res = pd.read_sql(query4, con=engine)
print(res)

   total_profit_margin
0             51027.99

Q.5 Retrieve all records where the payment method is not "Credit card".

In [34]:

query5 = """SELECT * 
FROM walmart_tbl
where payment_method != "Credit card";"""

res = pd.read_sql(query5, con=engine)
print(res)

       invoice_id   branch         city                category  unit_price  \
0               1  WALM003  San Antonio       Health and beauty       74.69
1               2  WALM048    Harlingen  Electronic accessories       15.28
2               4  WALM064      Bedford       Health and beauty       58.22
3               5  WALM013       Irving       Sports and travel       86.31
4               6  WALM026       Denton  Electronic accessories       85.39
...           ...      ...          ...                     ...         ...
74264        9995  WALM030   Richardson      Home and lifestyle       62.00
74265        9996  WALM056      Rowlett     Fashion accessories       37.00
74266        9997  WALM030   Richardson      Home and lifestyle       58.00
74267        9999  WALM032        Tyler      Home and lifestyle       79.00
74268       10000  WALM069     Rockwall     Fashion accessories       62.00

       quantity      date      time payment_method  rating  profit_margin  \
0           7.0  05/01/19  13:08:00        Ewallet     9.1           0.48
1           5.0  08/03/19  10:29:00           Cash     9.6           0.48
2           8.0  27/01/19  20:33:00        Ewallet     8.4           0.33
3           7.0  08/02/19  10:37:00        Ewallet     5.3           0.48
4           7.0  25/03/19  18:30:00        Ewallet     4.1           0.48
...         ...       ...       ...            ...     ...            ...
74264       1.0  15/02/21   9:04:00           Cash     3.0           0.48
74265       3.0  03/08/23  10:10:00           Cash     3.0           0.33
74266       2.0  22/02/21  14:20:00           Cash     7.0           0.48
74267       2.0  25/02/21  12:25:00           Cash     7.0           0.48
74268       3.0  26/09/20   9:48:00           Cash     3.0           0.33

        total
0      522.83
1       76.40
2      465.76
3      604.17
4      597.73
...       ...
74264   62.00
74265  111.00
74266  116.00
74267  158.00
74268  186.00

[74269 rows x 12 columns]

Q6. calculate the total revenue based on city 'San Antonio'.

In [35]:

query6 = """SELECT city, SUM(total) AS total_revenue 
FROM walmart_tbl 
GROUP BY city
having city = 'San Antonio';"""

res = pd.read_sql(query6, con=engine)
print(res)

          city  total_revenue
0  San Antonio      324357.28

Q.7 Find the city with the highest total revenue.

In [36]:

query7 = """SELECT city, max(total) AS max_revenue 
FROM walmart_tbl 
GROUP BY city
order by max_revenue desc
limit 1;"""

res = pd.read_sql(query7, con=engine)
print(res)

       city  max_revenue
0  McKinney        993.0

Q.8 For each branch, find the top category by total revenue.

In [37]:

query8 = """select *
from (
	SELECT branch,category,total,
	row_number() over(partition by branch order by total desc) as ranked
	from walmart_tbl
	) as row_data
where ranked = 1;"""

res = pd.read_sql(query8, con=engine)
print(res)

     branch                category   total  ranked
0   WALM001       Sports and travel  766.00       1
1   WALM002  Electronic accessories  524.70       1
2   WALM003      Home and lifestyle  906.50       1
3   WALM004  Electronic accessories  609.56       1
4   WALM005      Home and lifestyle  973.80       1
..      ...                     ...     ...     ...
95  WALM096      Food and beverages  846.30       1
96  WALM097  Electronic accessories  657.16       1
97  WALM098       Sports and travel  702.63       1
98  WALM099     Fashion accessories  749.16       1
99  WALM100       Health and beauty  874.98       1

[100 rows x 4 columns]

Q.9 Find the ranks of all city with the highest total revenue.

In [38]:

query9 = """SELECT city, sum(total),
rank() over(order by sum(total) desc) as ranked_city
from walmart_tbl
group by city;"""
    
res = pd.read_sql(query9, con=engine)
print(res)

            city  sum(total)  ranked_city
0        Weslaco   602573.27            1
1     Waxahachie   529143.29            2
2          Plano   333948.42            3
3    San Antonio   324357.28            4
4    Port Arthur   318816.81            5
..           ...         ...          ...
93      Longview    88001.29           94
94      Pearland    85447.83           95
95        Irving    81082.43           96
96    Lewisville    72394.92           97
97  Lake Jackson    65505.70           98

[98 rows x 3 columns]

Q.10 Find the top 3 branches with the highest average rating.

In [39]:

query10 = """SELECT branch, avg(rating) as avg_rating
	from walmart_tbl
    group by branch
    order by avg_rating desc
    limit 3;"""
    
res = pd.read_sql(query10, con=engine)
print(res)

    branch  avg_rating
0  WALM004    7.001667
1  WALM076    6.812162
2  WALM059    6.732911

Thank You!